IDEA Connection Link
ConnectionSrv.GetConnectionModelDesktop Method
 GetConnectionModelDesktop
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public IConnectionModel GetConnectionModelDesktop(
	Guid connectionId,
	int maskId = 0
)
Public Function GetConnectionModelDesktop (
	connectionId As Guid,
	Optional maskId As Integer = 0
) As IConnectionModel
public:
IConnectionModel^ GetConnectionModelDesktop(
	Guid connectionId,
	int maskId = 0
)
Parameters
connectionId
Type: System.Guid
[Missing <param name="connectionId"/> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetConnectionModelDesktop(System.Guid,System.Int32)"]
maskId (Optional)
Type: System.Int32
[Missing <param name="maskId"/> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetConnectionModelDesktop(System.Guid,System.Int32)"]
Return Value
Type: IConnectionModel
[Missing <returns> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetConnectionModelDesktop(System.Guid,System.Int32)"]
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace